package Seminars;

/*
 * В одной компьютерной игре игрок выставляет в линию шарики разных цветов. 
 * Когда образуется непрерывная цепочка из трех и более шариков одного цвета, 
 * она удаляется из линии. Все шарики при этом сдвигаются друг к другу, и ситуация может повториться.
 * 
 * Напишите программу, которая по данной ситуации определяет, сколько шариков будет сейчас уничтожено. 
 * Eстественно, непрерывных цепочек из трех и более одноцветных шаров в начальный может быть не более одной.
 * 
 * Формат входного файла
 * Даны количество шариков в цепочке (не более 1000) и 
 * цвета шариков (от 0 до 9, каждому цвету соответствует свое целое число).
 * 
 * Формат выходного файла
 * Требуется вывести количество шариков, которое будет уничтожено.
 * 
 * Ввод Вывод
 * 5 1 3 3 3 2 3
 * 10 3 3 2 1 1 1 2 2 3 3 10
*/
public class sem_3_1_balloons {
    
}
